docs: refactor secret management docs
